20220621/InformationRegisters/тм_СообщенияПользователям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_СообщенияПользователям</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Comment>Удаленный чат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/InformationRegisters/тм_СообщенияПользователям/Forms/ФормаЗаписиНовогоСообщения_старая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тм_СообщенияПользователям.ПользовательОтКого = Пользователи.ТекущийПользователь();
	тм_СообщенияПользователям.ИдентификаторСообщения = XMLСтрока(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Не ЗначениеЗаполнено(тм_СообщенияПользователям.ПользовательКому) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле Кому'"),, "ПользовательКому", "тм_СообщенияПользователям"); 
		Возврат;
	ИначеЕсли ПустаяСтрока(тм_СообщенияПользователям.Сообщение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле Сообщение'"),, "Сообщение", "тм_СообщенияПользователям"); 
		Возврат;	
	КонецЕсли; 
	
	ЗаписатьНаСервере();
	Оповестить("ОбновитьСписокЧата");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_СообщенияПользователям.Прочитано КАК Прочитано
		|ИЗ
		|	РегистрСведений.тм_СообщенияПользователям КАК тм_СообщенияПользователям
		|ГДЕ
		|	тм_СообщенияПользователям.ПользовательКому = &ПользовательКому
		|	И тм_СообщенияПользователям.ПользовательОтКого = &ПользовательОтКого
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	тм_СообщенияПользователям.Прочитано
		|ИЗ
		|	РегистрСведений.тм_СообщенияПользователям КАК тм_СообщенияПользователям
		|ГДЕ
		|	тм_СообщенияПользователям.ПользовательОтКого = &ПользовательКому
		|	И тм_СообщенияПользователям.ПользовательКому = &ПользовательОтКого";
	
	Запрос.УстановитьПараметр("ПользовательКому", тм_СообщенияПользователям.ПользовательКому);
	Запрос.УстановитьПараметр("ПользовательОтКого", тм_СообщенияПользователям.ПользовательОтКого);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Есть ранее созданные чаты. Удалите старые или продолжайте общение в старых :)'")); 
		Возврат ;
	КонецЕсли; 
	
	МЗ = РегистрыСведений.тм_СообщенияПользователям.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, тм_СообщенияПользователям);
	МЗ.Период = ТекущаяДатаСеанса();
	МЗ.Записать();
	
КонецПроцедуры
